wrk/results/get.log
Running 30s test @ http://localhost:8080
  4 threads and 128 connections
  Thread calibration: mean lat.: 1.830ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.266ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.357ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.513ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55ms    0.99ms  19.22ms   93.98%
    Req/Sec   247.80    122.80     0.89k    56.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.44ms
 75.000%    1.87ms
 90.000%    2.21ms
 99.000%    5.56ms
 99.900%   12.84ms
 99.990%   17.26ms
 99.999%   19.23ms
100.000%   19.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.468     0.000000            1         1.00
       0.753     0.100000         1869         1.11
       0.934     0.200000         3727         1.25
       1.090     0.300000         5582         1.43
       1.286     0.400000         7442         1.67
       1.438     0.500000         9299         2.00
       1.520     0.550000        10234         2.22
       1.602     0.600000        11167         2.50
       1.690     0.650000        12089         2.86
       1.782     0.700000        13028         3.33
       1.873     0.750000        13953         4.00
       1.917     0.775000        14421         4.44
       1.964     0.800000        14889         5.00
       2.019     0.825000        15358         5.71
       2.075     0.850000        15821         6.67
       2.137     0.875000        16276         8.00
       2.173     0.887500        16508         8.89
       2.213     0.900000        16750        10.00
       2.261     0.912500        16973        11.43
       2.321     0.925000        17210        13.33
       2.383     0.937500        17437        16.00
       2.429     0.943750        17553        17.78
       2.473     0.950000        17672        20.00
       2.525     0.956250        17790        22.86
       2.589     0.962500        17902        26.67
       2.707     0.968750        18018        32.00
       2.813     0.971875        18076        35.56
       2.999     0.975000        18134        40.00
       3.263     0.978125        18192        45.71
       3.593     0.981250        18250        53.33
       4.199     0.984375        18308        64.00
       4.459     0.985938        18338        71.11
       4.851     0.987500        18366        80.00
       5.263     0.989062        18395        91.43
       5.751     0.990625        18424       106.67
       6.543     0.992188        18453       128.00
       7.039     0.992969        18468       142.22
       7.327     0.993750        18482       160.00
       7.711     0.994531        18497       182.86
       8.067     0.995313        18511       213.33
       8.375     0.996094        18526       256.00
       8.831     0.996484        18533       284.44
       9.279     0.996875        18540       320.00
      10.127     0.997266        18548       365.71
      10.719     0.997656        18555       426.67
      11.207     0.998047        18562       512.00
      11.375     0.998242        18566       568.89
      11.951     0.998437        18569       640.00
      12.479     0.998633        18573       731.43
      12.719     0.998828        18577       853.33
      12.935     0.999023        18580      1024.00
      13.215     0.999121        18582      1137.78
      13.367     0.999219        18584      1280.00
      13.615     0.999316        18586      1462.86
      13.775     0.999414        18588      1706.67
      13.823     0.999512        18589      2048.00
      14.159     0.999561        18590      2275.56
      14.807     0.999609        18591      2560.00
      15.831     0.999658        18592      2925.71
      15.903     0.999707        18593      3413.33
      16.479     0.999756        18594      4096.00
      16.479     0.999780        18594      4551.11
      16.959     0.999805        18595      5120.00
      16.959     0.999829        18595      5851.43
      17.263     0.999854        18596      6826.67
      17.263     0.999878        18596      8192.00
      17.263     0.999890        18596      9102.22
      18.815     0.999902        18597     10240.00
      18.815     0.999915        18597     11702.86
      18.815     0.999927        18597     13653.33
      18.815     0.999939        18597     16384.00
      18.815     0.999945        18597     18204.44
      19.231     0.999951        18598     20480.00
      19.231     1.000000        18598          inf
#[Mean    =        1.551, StdDeviation   =        0.991]
#[Max     =       19.216, Total count    =        18598]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  34841 requests in 30.00s, 3.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 1490
Requests/sec:   1161.18
Transfer/sec:    116.66KB