wrk/results/get_alloc.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 1.132ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.466ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.38ms    1.04ms  17.92ms   93.67%
    Req/Sec     1.02k     0.95k    4.22k    53.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.51ms
 90.000%    1.95ms
 99.000%    6.24ms
 99.900%   12.11ms
 99.990%   16.62ms
 99.999%   17.93ms
100.000%   17.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.271     0.000000            1         1.00
       0.695     0.100000         3842         1.11
       0.844     0.200000         7692         1.25
       0.965     0.300000        11533         1.43
       1.082     0.400000        15365         1.67
       1.196     0.500000        19221         2.00
       1.254     0.550000        21118         2.22
       1.313     0.600000        23047         2.50
       1.372     0.650000        24949         2.86
       1.435     0.700000        26886         3.33
       1.507     0.750000        28785         4.00
       1.547     0.775000        29747         4.44
       1.592     0.800000        30716         5.00
       1.646     0.825000        31679         5.71
       1.716     0.850000        32632         6.67
       1.804     0.875000        33581         8.00
       1.868     0.887500        34067         8.89
       1.950     0.900000        34546        10.00
       2.055     0.912500        35019        11.43
       2.201     0.925000        35500        13.33
       2.415     0.937500        35982        16.00
       2.543     0.943750        36221        17.78
       2.711     0.950000        36459        20.00
       2.903     0.956250        36698        22.86
       3.169     0.962500        36940        26.67
       3.539     0.968750        37177        32.00
       3.727     0.971875        37299        35.56
       4.013     0.975000        37417        40.00
       4.311     0.978125        37539        45.71
       4.631     0.981250        37657        53.33
       5.059     0.984375        37777        64.00
       5.347     0.985938        37839        71.11
       5.619     0.987500        37898        80.00
       5.995     0.989062        37958        91.43
       6.395     0.990625        38017       106.67
       6.775     0.992188        38077       128.00
       7.019     0.992969        38107       142.22
       7.263     0.993750        38140       160.00
       7.511     0.994531        38167       182.86
       7.831     0.995313        38197       213.33
       8.223     0.996094        38227       256.00
       8.503     0.996484        38242       284.44
       8.887     0.996875        38257       320.00
       9.271     0.997266        38272       365.71
      10.151     0.997656        38287       426.67
      10.767     0.998047        38302       512.00
      10.919     0.998242        38309       568.89
      11.207     0.998437        38317       640.00
      11.511     0.998633        38324       731.43
      11.855     0.998828        38332       853.33
      12.207     0.999023        38340      1024.00
      12.567     0.999121        38343      1137.78
      13.591     0.999219        38347      1280.00
      13.911     0.999316        38350      1462.86
      14.319     0.999414        38354      1706.67
      14.775     0.999512        38358      2048.00
      15.159     0.999561        38360      2275.56
      15.223     0.999609        38362      2560.00
      15.231     0.999658        38363      2925.71
      15.639     0.999707        38365      3413.33
      15.743     0.999756        38367      4096.00
      15.783     0.999780        38368      4551.11
      15.935     0.999805        38369      5120.00
      16.055     0.999829        38370      5851.43
      16.431     0.999854        38371      6826.67
      16.623     0.999878        38372      8192.00
      16.623     0.999890        38372      9102.22
      16.671     0.999902        38373     10240.00
      16.671     0.999915        38373     11702.86
      16.943     0.999927        38374     13653.33
      16.943     0.999939        38374     16384.00
      16.943     0.999945        38374     18204.44
      17.519     0.999951        38375     20480.00
      17.519     0.999957        38375     23405.71
      17.519     0.999963        38375     27306.67
      17.519     0.999969        38375     32768.00
      17.519     0.999973        38375     36408.89
      17.935     0.999976        38376     40960.00
      17.935     1.000000        38376          inf
#[Mean    =        1.382, StdDeviation   =        1.038]
#[Max     =       17.920, Total count    =        38376]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71614 requests in 30.32s, 7.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 1341
Requests/sec:   2361.90
Transfer/sec:    239.27KB