wrk/results/get_cpu.log
Running 30s test @ http://localhost:8080
  2 threads and 128 connections
  Thread calibration: mean lat.: 1.127ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.323ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  781.59us  19.87ms   95.57%
    Req/Sec   757.01    624.55     2.80k    66.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.32ms
 90.000%    1.54ms
 99.000%    3.98ms
 99.900%   11.45ms
 99.990%   17.34ms
 99.999%   19.89ms
100.000%   19.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.284     0.000000            1         1.00
       0.581     0.100000         2819         1.11
       0.713     0.200000         5651         1.25
       0.833     0.300000         8458         1.43
       0.949     0.400000        11285         1.67
       1.054     0.500000        14103         2.00
       1.108     0.550000        15516         2.22
       1.161     0.600000        16930         2.50
       1.212     0.650000        18326         2.86
       1.264     0.700000        19728         3.33
       1.318     0.750000        21163         4.00
       1.345     0.775000        21857         4.44
       1.372     0.800000        22563         5.00
       1.401     0.825000        23251         5.71
       1.436     0.850000        23954         6.67
       1.479     0.875000        24666         8.00
       1.509     0.887500        25023         8.89
       1.541     0.900000        25367        10.00
       1.582     0.912500        25719        11.43
       1.634     0.925000        26066        13.33
       1.706     0.937500        26419        16.00
       1.757     0.943750        26594        17.78
       1.819     0.950000        26772        20.00
       1.889     0.956250        26949        22.86
       1.992     0.962500        27124        26.67
       2.145     0.968750        27300        32.00
       2.235     0.971875        27387        35.56
       2.371     0.975000        27475        40.00
       2.499     0.978125        27564        45.71
       2.723     0.981250        27651        53.33
       3.009     0.984375        27739        64.00
       3.215     0.985938        27783        71.11
       3.487     0.987500        27827        80.00
       3.791     0.989062        27871        91.43
       4.031     0.990625        27915       106.67
       4.495     0.992188        27959       128.00
       4.759     0.992969        27981       142.22
       5.043     0.993750        28003       160.00
       5.399     0.994531        28025       182.86
       5.715     0.995313        28047       213.33
       6.179     0.996094        28069       256.00
       6.467     0.996484        28080       284.44
       6.791     0.996875        28091       320.00
       7.175     0.997266        28103       365.71
       7.855     0.997656        28113       426.67
       8.407     0.998047        28124       512.00
       8.927     0.998242        28130       568.89
       9.383     0.998437        28135       640.00
       9.871     0.998633        28141       731.43
      11.071     0.998828        28146       853.33
      11.519     0.999023        28152      1024.00
      12.335     0.999121        28155      1137.78
      12.575     0.999219        28157      1280.00
      12.959     0.999316        28160      1462.86
      13.815     0.999414        28163      1706.67
      14.303     0.999512        28166      2048.00
      14.951     0.999561        28167      2275.56
      16.287     0.999609        28168      2560.00
      16.495     0.999658        28170      2925.71
      16.575     0.999707        28171      3413.33
      16.735     0.999756        28173      4096.00
      16.735     0.999780        28173      4551.11
      16.783     0.999805        28174      5120.00
      16.959     0.999829        28175      5851.43
      16.959     0.999854        28175      6826.67
      17.343     0.999878        28176      8192.00
      17.343     0.999890        28176      9102.22
      18.239     0.999902        28177     10240.00
      18.239     0.999915        28177     11702.86
      18.239     0.999927        28177     13653.33
      18.847     0.999939        28178     16384.00
      18.847     0.999945        28178     18204.44
      18.847     0.999951        28178     20480.00
      18.847     0.999957        28178     23405.71
      18.847     0.999963        28178     27306.67
      19.887     0.999969        28179     32768.00
      19.887     1.000000        28179          inf
#[Mean    =        1.133, StdDeviation   =        0.782]
#[Max     =       19.872, Total count    =        28179]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49816 requests in 30.01s, 4.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 1417
Requests/sec:   1660.13
Transfer/sec:    168.04KB